src/cf/InformationRegisters/MessageExchangeTransportSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>MessageExchangeTransportSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>WebServiceAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>165</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RememberPassword</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Endpoint</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.MessageExchange</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ExchangeMessagesTransportTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ExchangeMessagesTransportTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EMAIL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FILE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WSPassiveMode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExternalSystem</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/MessageExchangeTransportSettings/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Adds a record to the register by the passed structure values.
Procedure AddRecord(RecordStructure) Export
	
	BeginTransaction();
	Try
		RecordSet = CreateRecordSet();
		If RecordStructure.Property("Endpoint") Then
			RecordSet.Filter.Endpoint.Set(RecordStructure.Endpoint);
		EndIf;
		
		NewRecord = RecordSet.Add();
		FillPropertyValues(NewRecord, RecordStructure);
		RecordSet.Write();
		
		WritePassword("Password", "WSPassword", RecordStructure);
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure

// Updates a register record based on the passed structure values.
Procedure UpdateRecord(RecordStructure) Export
	
	BeginTransaction();
	Try
		RecordManager = CreateRecordManager();
		If RecordStructure.Property("Endpoint") Then
			RecordManager.Endpoint = RecordStructure.Endpoint;
		EndIf;
		
		RecordManager.Read();
		FillPropertyValues(RecordManager, RecordStructure);
		RecordManager.Write();
		
		WritePassword("Password", "WSPassword", RecordStructure);
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure

// For internal use.
// 
Function TransportSettingsWS(Endpoint, AuthenticationParameters = Undefined) Export
	
	Result = New Structure;
	Result.Insert("DefaultExchangeMessagesTransportKind", Enums.ExchangeMessagesTransportTypes.WS);
	Result.Insert("WSWebServiceURL");
	Result.Insert("WSUsername");
	Result.Insert("WSRememberPassword");
	Result.Insert("WSPassword");
	
	Query = New Query(
	"SELECT
	|	TransportSettings.WebServiceAddress AS WSWebServiceURL,
	|	TransportSettings.UserName AS WSUsername,
	|	TransportSettings.RememberPassword AS WSRememberPassword
	|FROM
	|	InformationRegister.MessageExchangeTransportSettings AS TransportSettings
	|WHERE
	|	TransportSettings.Endpoint = &Endpoint");
	Query.SetParameter("Endpoint", Endpoint);
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		FillPropertyValues(Result, Selection);
	EndIf;
	
	SetPrivilegedMode(True);
	WSPassword = Common.ReadDataFromSecureStorage(Endpoint, "WSPassword", True);
	SetPrivilegedMode(False);
	
	If TypeOf(WSPassword) = Type("String")
		Or WSPassword = Undefined Then
		
		Result.Insert("WSPassword", WSPassword);
	Else
		Raise NStr("ru='Ошибка при извлечении пароля из безопасного хранилища.'; en = 'An error occurred while extracting password from secure storage.'; pl = 'Błąd podczas pobierania hasła z bezpiecznej przechowalni.';de = 'Fehler beim Abrufen des Passworts vom sicheren Speicher.';ro = 'Eroare la extragerea parolei din storagele securizat.';tr = 'Güvenli depolamadan şifre alınırken hata oluştu.'; es_ES = 'Error al extraer la contraseña del almacenamiento seguro.'");
	EndIf;
	
	If TypeOf(AuthenticationParameters) = Type("Structure") Then // Initializing exchange using the current user name.
		
		If AuthenticationParameters.UseCurrentUser Then
			
			Result.WSUsername = InfoBaseUsers.CurrentUser().Name;
			
		EndIf;
		
		Password = Undefined;
		
		If AuthenticationParameters.Property("Password", Password)
			AND Password <> Undefined Then // The password is specified on the client
			
			Result.WSPassword = Password;
			
		Else // The password is not specified on the client.
			
			Password = DataSynchronizationPassword(Endpoint);
			Result.WSPassword = ?(Password = Undefined, "", Password);
			
		EndIf;
		
	ElsIf TypeOf(AuthenticationParameters) = Type("String") Then
		Result.WSPassword = AuthenticationParameters;
	EndIf;
	
	Return Result;
	
EndFunction

#EndRegion

#Region Private

Procedure WritePassword(PasswordNameInStructure, PasswordNameOnWrite, RecordStructure)
	
	If RecordStructure.Property(PasswordNameInStructure) Then
		SetPrivilegedMode(True);
		Common.WriteDataToSecureStorage(RecordStructure.Endpoint,
			RecordStructure[PasswordNameInStructure], PasswordNameOnWrite);
		SetPrivilegedMode(False);
	EndIf;
	
EndProcedure

Function DataSynchronizationPassword(InfobaseNode)
	
	Password = Undefined;
	
	If Common.SubsystemExists("StandardSubsystems.DataExchange") Then
		SetPrivilegedMode(True);
		Password = SessionParameters.DataSynchronizationPasswords.Get(InfobaseNode);
	EndIf;
	
	Return Password;
	
EndFunction

#EndRegion

#EndIf
